In [ ]:
# 1 st question
# Rename column names using function. "First Name" --> "first_name", "Age" --> "age
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [9]:
df.columns

Index(['First Name', 'Age', 'City'], dtype='object')

In [11]:
our_columns=df[["First Name","Age","City"]]
our_columns

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [12]:
new_col={"First Name":"first_name",
         "Age":"age"}
new_col

{'First Name': 'first_name', 'Age': 'age'}

In [13]:
renames_columns=our_columns.rename(columns=new_col)
renames_columns

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [17]:
# 2 nd question
# Print the first 3 rows of the DataFrame
df.iloc[0:3]

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [32]:
# 3 rd question
# Find the mean age of the individuals
mean_age = renames_columns['age'].mean()
mean_age

np.float64(32.5)

In [38]:
# 4 th question
# Select and print only the 'Name' and 'City' columns
print(renames_columns[['first_name', 'City']])

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [42]:
# 5 th question
# Add a new column 'Salary' with random salary values
import numpy as np
renames_columns['Salary'] = np.random.randint(50000, 100001, size=len(renames_columns))
renames_columns

  first_name  age           City  Salary
0      Alice   25       New York   97455
1        Bob   30  San Francisco   99112
2    Charlie   35    Los Angeles   74465
3      David   40        Chicago   86029

In [45]:
# 6 th question
# Display summary statistics of the DataFrame
print(renames_columns.describe(include='all'))

       first_name        age      City        Salary
count           4   4.000000         4      4.000000
unique          4        NaN         4           NaN
top         Alice        NaN  New York           NaN
freq            1        NaN         1           NaN
mean          NaN  32.500000       NaN  89265.250000
std           NaN   6.454972       NaN  11453.546827
min           NaN  25.000000       NaN  74465.000000
25%           NaN  28.750000       NaN  83138.000000
50%           NaN  32.500000       NaN  91742.000000
75%           NaN  36.250000       NaN  97869.250000
max           NaN  40.000000       NaN  99112.000000

In [56]:
## 2 nd Homework
import pandas as pd

data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500]
}

sales_and_expenses = pd.DataFrame(data)

def Our_frame(df):
    return df.rename(columns={
        'Month': 'Month_Name',
        'Sales': 'Total_Sales',
        'Expenses': 'Total_Expenses'
    })


sales_and_expenses = Our_frame(sales_and_expenses)

print(sales_and_expenses)

  Month_Name  Total_Sales  Total_Expenses
0        Jan         5000            3000
1        Feb         6000            3500
2        Mar         7500            4000
3        Apr         8000            4500

In [69]:
## 2 nd question
# Calculate and display the maximum sales and expenses.
max_sales = Our_frame['Sales'].max()
max_expenses = Our_frame['Expenses'].max()
print('Max Sales is equal to:', max_sales)
print('Max Expenses are equal to:', max_expenses)

Max Sales is equal to: 8000
Max Expenses are equal to: 4500

In [70]:
# 3 rd question
# Calculate and display the minimum sales and expenses.
min_sale=Our_frame['Sales'].min()
min_expenses=Our_frame['Expenses'].min()
print("Minimum sales is:", min_sale)
print("Minimum expenses is:", min_expenses)

Minimum sales is: 5000
Minimum expenses is: 3000

In [72]:
# 4 th question
# alculate and display the average sales and expenses.
Average_sales=Our_frame['Sales'].mean()
Average_Expenses=Our_frame['Expenses'].mean()
print("Average sale is:", Average_sales)
print("Average Expenses are:", Average_Expenses)

Average sale is: 6625.0
Average Expenses are: 3750.0

In [73]:
# Homework 3
# Create a DataFrame named expenses with columns 'Category', 'January', 'February',
#  'March', and 'April', representing monthly expenses for different categories. Use below table.
import pandas as pd

data = {
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'],
    'January': [1200, 200, 300, 150],
    'February': [1300, 220, 320, 160],
    'March': [1400, 240, 330, 170],
    'April': [1500, 250, 350, 180]
}

expenses = pd.DataFrame(data)

print(expenses)

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [79]:
# 2 nd question
# Calculate and display the maximum expense for each category.
expenses['Max_Expense'] = expenses[['January', 'February', 'March', 'April']].max(axis=1)


print(expenses[['Category', 'Max_Expense']])

        Category  Max_Expense
0           Rent         1500
1      Utilities          250
2      Groceries          350
3  Entertainment          180

In [81]:
# 3 rd question
# Calculate and display the minimum expense for each category.
expenses["Min_Expenses"]=expenses[['January', 'February', 'March', 'April']].min(axis=1)
print(expenses[["Category","Min_Expenses"]])

        Category  Min_Expenses
0           Rent          1200
1      Utilities           200
2      Groceries           300
3  Entertainment           150

In [86]:
# 4 th question
# Calculate and display the average expense for each category.
expenses["average_Expenses"]=expenses[['January', 'February', 'March', 'April']].mean(axis=1)
expenses[["Category","average_Expenses"]]

        Category  average_Expenses
0           Rent            1350.0
1      Utilities             227.5
2      Groceries             325.0
3  Entertainment             165.0

In [87]:
# In this task, use .set_index method to make Category column as index.

# Try this code, learn it and use it in the task.

# expenses.set_index('Category')

expenses_indexed = expenses.set_index('Category')


print(expenses_indexed.max(axis=1))

Category
Rent             1500.0
Utilities         250.0
Groceries         350.0
Entertainment     180.0
dtype: float64